# Chapter 5 Pandas 시작하기 공부
- CopyRight to Python for Data Analysis - 웨스 맥키니 - OREILLY, 한빛 미디어
- Typing and Studying by SGH in 2019.12.30
- URL : https://github.com/wesm/pydata-book
- URL : https://github.com/wikibook/python-for-data-analysis

# 5.1 pandas 자료 구조 소개

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = Series([4,7,-5,3], index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['a']

-5

In [8]:
obj2['d']=6
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [9]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [10]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [11]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [12]:
'b' in obj2

True

In [13]:
'e' in obj2

False

In [14]:
sdata = {'Ohio': 35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [16]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [23]:
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [25]:
DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [26]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [27]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [28]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [29]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [30]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [31]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [32]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [33]:
val = Series([-1.2,-1.5,-1.7], index=['two','four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [34]:
frame2['eastern'] = frame.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN     NaN
two    2001    Ohio  1.7  -1.2     NaN
three  2002    Ohio  3.6   NaN     NaN
four   2001  Nevada  2.4  -1.5     NaN
five   2002  Nevada  2.9  -1.7     NaN

In [35]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [36]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [37]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [38]:
DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [39]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [40]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [41]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [42]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [43]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [44]:
obj = Series(range(3), index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [45]:
index[1:]

Index(['b', 'c'], dtype='object')

In [46]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [47]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [48]:
'Ohio' in frame3.columns

True

In [49]:
2003 in frame3.index

False

In [50]:
frame3.index.isin([2003])

array([False, False, False])

# 5.2 핵심 기능

In [51]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [52]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [53]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [54]:
obj3 = Series(['blue','purple','yellow'], index=[0,2,4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [55]:
obj33 = Series(['blue','purple','yellow'], index=[1,3,5])
obj33.reindex(range(6), method='bfill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [56]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'], columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [57]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [58]:
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [59]:
frame.reindex(index=['a','b','c','d'], method='ffill')
#frame.reindex(index=['a','b','c','d'], method='ffill', columns=states)
#위 코드는 ValueError: index must be monotonic increasing or decreasing
#NaN이 method와 상충되는 문제가 생긴 듯

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [60]:
frame.reindex(index=['a','b','c','d'], fill_value=0, columns=states)

   Texas  Utah  California
a      1     0           2
b      0     0           0
c      4     0           5
d      7     0           8

In [61]:
frame.reindex(index=['a','b','c','d'], columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [62]:
frame.loc[['a','b','c','d'],states]

C:\Users\la\Anaconda3\envs\tf20\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [63]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [64]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [65]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [67]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [68]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [69]:
obj = Series(np.arange(4.), index=['a','b','c','d'])
obj['b']

1.0

In [70]:
obj[1]

1.0

In [71]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [72]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [73]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [74]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [75]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [76]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [77]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [78]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [79]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [80]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [81]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [83]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [85]:
#data.ix[['Colorado', 'Utah'], [3, 0, 1]]
data.loc[['Colorado','Utah'],['four','one','two']]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [86]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [87]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [88]:
data.loc[data.three>5,:'four']

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [89]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [90]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [91]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [92]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [93]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [94]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [95]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [96]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [97]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [98]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [99]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [100]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [101]:
arr[0]

array([0., 1., 2., 3.])

In [102]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [103]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [104]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [105]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [106]:
series2 = Series(range(3), index=['b','e','f'])
series2

b    0
e    1
f    2
dtype: int64

In [107]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [108]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [109]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [110]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [111]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.497725  0.639766 -0.244232
Ohio    1.927277  2.595824 -1.919354
Texas  -2.865254 -1.534558 -1.205342
Oregon  0.824759 -0.584783  1.119214

In [112]:
np.abs(frame)

               b         d         e
Utah    1.497725  0.639766  0.244232
Ohio    1.927277  2.595824  1.919354
Texas   2.865254  1.534558  1.205342
Oregon  0.824759  0.584783  1.119214

In [113]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    4.792532
d    4.130382
e    3.038568
dtype: float64

In [114]:
frame.apply(f, axis=1)

Utah      1.741957
Ohio      4.515177
Texas     1.659912
Oregon    1.703997
dtype: float64

In [115]:
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])
frame.apply(f)

            b         d         e
min -2.865254 -1.534558 -1.919354
max  1.927277  2.595824  1.119214

In [116]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     1.50   0.64  -0.24
Ohio     1.93   2.60  -1.92
Texas   -2.87  -1.53  -1.21
Oregon   0.82  -0.58   1.12

In [117]:
# TypeError: ("cannot convert the series to <class 'float'>", 'occurred at index b')
# frame.apply(format)

In [118]:
frame['e'].map(format)

Utah      -0.24
Ohio      -1.92
Texas     -1.21
Oregon     1.12
Name: e, dtype: object

In [119]:
frame['e'].apply(format)

Utah      -0.24
Ohio      -1.92
Texas     -1.21
Oregon     1.12
Name: e, dtype: object

In [120]:
obj = Series(range(4), index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [121]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [122]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [123]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [124]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [125]:
obj = Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [126]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [127]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [128]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [129]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [130]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [131]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [132]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [133]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [134]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [135]:
obj = Series(range(5), index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [136]:
obj.index.is_unique

False

In [137]:
obj['a']

a    0
a    1
dtype: int64

In [138]:
obj['c']

4

In [139]:
df = DataFrame(np.random.randn(4,3), index=['a','a','b','b'])
df

          0         1         2
a -1.057615 -0.521789  1.070723
a -0.801569 -1.878086  1.800169
b  0.646967 -0.690949  0.536765
b  0.189128 -0.330311 -0.277840

# 5.3 기술통계 계산과 요약

In [140]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [141]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [142]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [143]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [144]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [145]:
df.idxmax()

one    b
two    d
dtype: object

In [146]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [147]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [148]:
obj = Series(['a','a','b','c']*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [149]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [150]:
import pandas as pd
from pandas_datareader import data

In [151]:
import pandas_datareader
print(pandas_datareader.__version__)

0.8.1

In [152]:
# NotImplementedError: data_source='google' is not implemented
# google -> yahoo
all_data={}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOGL']:
    all_data[ticker] = data.DataReader(ticker, 'yahoo', '2015-01-01', '2016-01-01')
    
price = DataFrame({tic: data['Close'] for tic,data in all_data.items()})
volume = DataFrame({tic: data['Volume'] for tic,data in all_data.items()})

In [153]:
price.shape, volume.shape

((253, 4), (253, 4))

In [154]:
price[:5]

                  AAPL         IBM       MSFT       GOOGL
Date
2014-12-31  110.379997  160.440002  46.450001  530.659973
2015-01-02  109.330002  162.059998  46.759998  529.549988
2015-01-05  106.250000  159.509995  46.330002  519.460022
2015-01-06  106.260002  156.070007  45.650002  506.640015
2015-01-07  107.750000  155.050003  46.230000  505.149994

In [155]:
volume[:5]

                  AAPL        IBM        MSFT    GOOGL
Date
2014-12-31  41403400.0  4011900.0  21552500.0  1232400
2015-01-02  53204600.0  5525500.0  27913900.0  1324000
2015-01-05  64285500.0  4880400.0  39673900.0  2059100
2015-01-06  65797100.0  6146700.0  36447900.0  2722800
2015-01-07  40105900.0  4701800.0  29114100.0  2345900

In [156]:
returns = price.pct_change() # 퍼센트 변화율
returns.tail()

                AAPL       IBM      MSFT     GOOGL
Date
2015-12-24 -0.005340 -0.002093 -0.002687 -0.003474
2015-12-28 -0.011201 -0.004629  0.005030  0.021414
2015-12-29  0.017974  0.015769  0.010724  0.014983
2015-12-30 -0.013059 -0.003148 -0.004244 -0.004610
2015-12-31 -0.019195 -0.012344 -0.014740 -0.015551

In [157]:
returns.MSFT.corr(returns.IBM)

0.5501734168185448

In [158]:
returns.MSFT.cov(returns.IBM)

0.0001312719700990277

In [159]:
returns.corr()

           AAPL       IBM      MSFT     GOOGL
AAPL   1.000000  0.513448  0.522070  0.374665
IBM    0.513448  1.000000  0.550173  0.451871
MSFT   0.522070  0.550173  1.000000  0.491046
GOOGL  0.374665  0.451871  0.491046  1.000000

In [160]:
returns.cov()

           AAPL       IBM      MSFT     GOOGL
AAPL   0.000284  0.000116  0.000157  0.000115
IBM    0.000116  0.000180  0.000131  0.000110
MSFT   0.000157  0.000131  0.000317  0.000159
GOOGL  0.000115  0.000110  0.000159  0.000330

In [161]:
returns.corrwith(returns.IBM)

AAPL     0.513448
IBM      1.000000
MSFT     0.550173
GOOGL    0.451871
dtype: float64

In [162]:
returns.corrwith(volume)

AAPL    -0.118379
IBM     -0.290693
MSFT    -0.001992
GOOGL    0.447388
dtype: float64

In [163]:
obj = Series(['c','a','d','a','a','b','b','c','c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [164]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [165]:
pd.value_counts(obj.values, sort=False)

b    2
a    3
c    3
d    1
dtype: int64

In [166]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [167]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [168]:
data = DataFrame({'Qu1': [1,3,4,3,4], 'Qu2': [2,3,1,2,3], 'Qu3': [1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [169]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# 5.4 누락된 데이터 처리하기

In [170]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [171]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [172]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [173]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [174]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [175]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [176]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [177]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [178]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [179]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [180]:
df = DataFrame(np.random.randn(7,3))
df.loc[:4,1] = NA
df.loc[:2,2] = NA
df

          0         1         2
0 -1.419857       NaN       NaN
1  1.498219       NaN       NaN
2  0.618945       NaN       NaN
3 -1.122590       NaN  0.392896
4  0.649256       NaN  1.266706
5  0.742917  0.006877  0.096448
6 -0.935759  0.806487  0.085782

In [181]:
df.dropna(thresh=3)

          0         1         2
5  0.742917  0.006877  0.096448
6 -0.935759  0.806487  0.085782

In [182]:
df.fillna(0)

          0         1         2
0 -1.419857  0.000000  0.000000
1  1.498219  0.000000  0.000000
2  0.618945  0.000000  0.000000
3 -1.122590  0.000000  0.392896
4  0.649256  0.000000  1.266706
5  0.742917  0.006877  0.096448
6 -0.935759  0.806487  0.085782

In [183]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -1.419857  0.500000       NaN
1  1.498219  0.500000       NaN
2  0.618945  0.500000       NaN
3 -1.122590  0.500000  0.392896
4  0.649256  0.500000  1.266706
5  0.742917  0.006877  0.096448
6 -0.935759  0.806487  0.085782

In [184]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.419857  0.000000  0.000000
1  1.498219  0.000000  0.000000
2  0.618945  0.000000  0.000000
3 -1.122590  0.000000  0.392896
4  0.649256  0.000000  1.266706
5  0.742917  0.006877  0.096448
6 -0.935759  0.806487  0.085782

In [185]:
df = DataFrame(np.random.randn(6,3))
df.loc[2:,1] = NA
df.loc[4:,2] = NA
df

          0         1         2
0  1.429188  0.191035 -0.504852
1  0.740771  1.129930 -0.384787
2 -1.821174       NaN -0.353319
3 -0.357985       NaN -0.710435
4  0.280932       NaN       NaN
5 -0.496191       NaN       NaN

In [186]:
df.fillna(method='ffill')

          0         1         2
0  1.429188  0.191035 -0.504852
1  0.740771  1.129930 -0.384787
2 -1.821174  1.129930 -0.353319
3 -0.357985  1.129930 -0.710435
4  0.280932  1.129930 -0.710435
5 -0.496191  1.129930 -0.710435

In [187]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.429188  0.191035 -0.504852
1  0.740771  1.129930 -0.384787
2 -1.821174  1.129930 -0.353319
3 -0.357985  1.129930 -0.710435
4  0.280932       NaN -0.710435
5 -0.496191       NaN -0.710435

In [188]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 5.5 계층적 색인 Hierarchical indexing

In [189]:
data = Series(np.random.randn(10), index=[['a','a','a','b','b','b','c','c','d','d'], [1,2,3,1,2,3,1,2,2,3]])
data

a  1    0.074162
   2    0.607658
   3    0.484666
b  1   -0.003935
   2    0.992573
   3    0.978873
c  1   -0.129899
   2   -1.672737
d  2   -0.213844
   3   -0.013111
dtype: float64

In [190]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [191]:
data['b']

1   -0.003935
2    0.992573
3    0.978873
dtype: float64

In [192]:
data['b':'c']

b  1   -0.003935
   2    0.992573
   3    0.978873
c  1   -0.129899
   2   -1.672737
dtype: float64

In [193]:
data.loc[['b','d']]

b  1   -0.003935
   2    0.992573
   3    0.978873
d  2   -0.213844
   3   -0.013111
dtype: float64

In [194]:
data[:,2]

a    0.607658
b    0.992573
c   -1.672737
d   -0.213844
dtype: float64

In [195]:
data.unstack()

          1         2         3
a  0.074162  0.607658  0.484666
b -0.003935  0.992573  0.978873
c -0.129899 -1.672737       NaN
d       NaN -0.213844 -0.013111

In [196]:
data.unstack().stack()

a  1    0.074162
   2    0.607658
   3    0.484666
b  1   -0.003935
   2    0.992573
   3    0.978873
c  1   -0.129899
   2   -1.672737
d  2   -0.213844
   3   -0.013111
dtype: float64

In [197]:
frame = DataFrame(np.arange(12).reshape((4,3)), index=[['a','a','b','b'], [1,2,1,2]], 
                  columns=[['Ohio','Ohio','Colorado'], ['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [198]:
frame.index.names=['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [199]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [200]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [201]:
# frame.sortlevel(1)

# AttributeError: 'DataFrame' object has no attribute 'sortlevel'
# Deprecated since version 0.20.0: Use DataFrame.sort_index()

In [202]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [203]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [204]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1), 
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'], 'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [205]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [206]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# 5.6 pandas와 관련된 기타 주제

In [207]:
ser = Series(np.arange(3.))
ser

# error
# ser[-1]

0    0.0
1    1.0
2    2.0
dtype: float64

In [208]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [209]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [210]:
ser3 = Series(range(3), index=[-5,1,3])
ser3.iloc[2]

2

In [211]:
frame = DataFrame(np.arange(6).reshape((3,2)), index=[2, 0, 1])
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

```python

from pandas_datareader import data
import datetime
start = datetime.datetime(2015,1,1)
end = datetime.datetime(2016,1,1)

# error : KeyError: 'Date'
pdata = pd.Panel(dict((stk, data.get_data_yahoo(stk, '2015-01-01', '2016-01-01')) for stk in ['AAPL', 'GOOGL', 'MSFT', 'DELL.MX']))

pdata
pdata = pdata.swapaxes('items', 'minor')
pdata['Close']
```